/* @source: https://github.com/R0bur/drawing-actor/blob/main/script/bulletin.js */
/* @license magnet:?xt=urn:btih:1f739d935676111cfff4b4693e3816e664797050&dn=gpl-3.0.txt GPL-v3-or-Later */
/*=================================================*/
/* Объект "объявления" - область вывода сообщений. */
/*=================================================*/
var bulletin = new Object ();
/*=============================================*/
/* Метод объекта "объявления" - инициализация. */
/*=============================================*/
bulletin.init = function (elem) {
	elem.innerText = "";
	this.elem = elem;
};
/*===============================================================*/
/* Метод объекта "объявления" - приведение в исходное состояние. */
/*===============================================================*/
bulletin.reset = function () {
	this.elem.innerText = "";
	this.elem.className = "";
};
/*==============================================================*/
/* Метод объекта "объявления" - размещение сообщения об ошибке. */
/* Вызов: s - текст сообщения об ошибке.                        */
/*==============================================================*/
bulletin.placeError = function (s) {
	this.elem.innerText = s;
	this.elem.className = "error";
};
/*==============================================================*/
/* Метод объекта "объявления" - размещение сообщения об успехе. */
/* Вызов: s - текст сообщения об успехе.                       */
/*==============================================================*/
bulletin.placeSuccess = function (s) {
	this.elem.innerText = s;
	this.elem.className = "success";
};
/*====================================================================*/
/* Метод объекта "объявления" - размещение информационного сообщения. */
/* Вызов: s - текст информационного сообщения.                        */
/*====================================================================*/
bulletin.placeInfo = function (s) {
	this.elem.innerText = s;
	this.elem.className = "";
};
/* @license-end */