/* @source: https://github.com/R0bur/drawing-actor/blob/main/script/i18n_ru.js */
/* @license magnet:?xt=urn:btih:1f739d935676111cfff4b4693e3816e664797050&dn=gpl-3.0.txt GPL-v3-or-Later */
/*================================*/
/* Дерево языка программирования. */
/*================================*/
i18n.plTree.ru = {
	"прыжок": -1,
	"шаг": -2,
	"поворот": -3,
	"если": {
		"впереди": {
			"край,": {"то": 1},
			"не": {"край,": {"то": 2}}
		},
	},
	"иначе": 3,
	"пока": {
		"впереди": {
			"край,": {"повторять": 4},
			"не": {"край,": {"повторять": 5}}
		},
	},
	"конец": {
		"ветвления": 6,
		"цикла": 7,
		"процедуры": 8
	},
	"процедура": {"!имя": 9},
	"сделай": {"!имя": 10}
};
/*====================================================*/
/* Пункты меню с командами в режиме программирования. */
/*====================================================*/
i18n.edTree.ru = {
	"F1": "прыжок^прыжок.",
	"F2": "шаг^шаг.",
	"F3": "поворот^поворот.",
	"F4": ["…^ ", {
		"F4": ["если…^если ", {
			"F1": "…впереди край^впереди край, то.",
			"F2": "…впереди не край^впереди не край, то."
		}],
		"F5": "иначе^иначе.",
		"F6": ["пока…^пока ", {
			"F1": "…впереди край^впереди край, повторять.",
			"F2": "…впереди не край^впереди не край, повторять."
		}],
		"F7": "сделай^сделай ",
		"F8": "проц^процедура ",
		"F9": ["конец…^конец ", {
			"F1": "…ветвления^ветвления.",
			"F2": "…цикла^цикла.",
			"F3": "…процедуры^процедуры."
		}]
	}]
};
/*================*/
/* Таблица строк. */
/*================*/
i18n.strTable.ru = {
	/*------------*/
	/* index.html */
	/*------------*/
	1000: "ГРИС «Букашка»",
	1001: "%1. Версия %2.",
	/*----------*/
	/* index.js */
	/*----------*/
	/* Пункт меню и сообщения о выходе исполнителя за границы области рисования. */
	1: "сброс",
	2: "АВАРИЯ - исполнитель вышел за границу доски.",
	3: "Нажмите [ESC] для возврата в исходное положение.",
	/* Заголовок и информационное сообщение режима №1 (непосредственное выполнение команд). */
	4: "Режим №1: Непосредственное выполнение команд.",
	5: "Управляйте исполнителем с помощью [F1], [F2] и [F3].\nНажмите [ESC], чтобы очистить доску для рисования.",
	6: "Нажмите [TAB] для перехода в режим программирования.",
	/* Заголовок и информационное сообщение режима №2 (программирование). */
	7: "Режим №2: Программирование исполнителя.",
	8: "Вводите и исправляйте программу.\nНажмите [ESC], чтобы стереть текст программы.",
	9: "Нажмите [TAB] для перехода в режим выполнения программы.",
	/* Заголовок и информационное сообщение режима №3 (выполнение программы). */
	10: "Режим №3: Выполнение программы.",
	11: "Нажмите [TAB] для перехода в режим непосредственного выполнения команд.",
	/* Сообщения об успешном завершении программы. */
	12: "+Выполнение программы успешно завершено.",
	13: "Сделано прыжков: %1, шагов: %2, поворотов: %3.",
	14: "Всего действий: %1.",
	/* Сообщения о прекращении выполнения программы пользователем. */
	15: "Программа остановлена.",
	16: "Выполнение программы прервано пользователем.",
	/* Сообщение о прерывании отладки программы пользователем. */
	17: "-Отладка программы прервана пользователем.",
	/* Пункты меню подрежима выполнения программы. */
	18: "стоп",
	19: "отладка",
	/* Сообщение о продолжении выполнения программы после отладки. */
	20: "Программа выполняется…",
	/* Пункты меню подрежима отладки программы. */
	21: "сброс",
	22: "дальше",
	23: "выполнить",
	/* Сообщение о переходе в режим отладки программы. */
	24: "Идёт отладка программы…",
	/* Пункты меню подрежима программирования для ввода дополнительных команд. */
	54: "назад",
	/* Запрос подтверждения на очистку содержимого редактора текста программы. */
	55: "Стереть всю программу?",
	/* Пункты меню режима №1 (непосредственное выполнение команд). */
	56: "прыжок",
	57: "шаг",
	58: "поворот",
	59: "сброс",
	60: "программирование",
	/* Пункты меню режима №2 (программирование). */
	64: "стереть",
	65: "выполнение",
	/* Пункты меню режима №3 (выполнение программы). */
	66: "пуск",
	67: "отладка",
	68: "результат",
	69: "сброс",
	70: "командование",
	/* Строка состояния. */
	71: "Звук [Alt+s]:",
	72: "норм.",
	73: "расш.",
	74: "нет",
	/* Время выполнения программы. */
	75: "Время выполнения: %1 сек.",
	/* Решение задачи. */
	76: "+Задание ВЫПОЛНЕНО!",
	77: "-Задание НЕ выполнено, потому что:",
	78: "не все заданные отрезки закрашены (%1)",
	79: "некоторые отрезки закрашены ошибочно (%1)",
	80: "исполнитель не занял требуемое положение",
	81: "Введите упакованное условие задачи (пустая строка убирает поставленную задачу).\nВставка из буфера обмена: Ctrl+V, Enter.",
	82: "Ошибка: не удалось распаковать условие задачи!",
	83: "Вот строка с упакованным условием задачи.\nКопирование в буфер обмена: Ctrl+C, Enter.",
	/* Дополнительная информационная строка для режима выполнения программы. */
	84: "Нажмите [F1] для запуска программы или [F5] для быстрого получения результата.",
	/*------------*/
	/* program.js */
	/*------------*/
	101: "Синтаксическая ошибка.",
	102: "конец строки",
	103: "Ошибка выполнения программы.",
	104: "Отсутствует команда \"%1\".",
	105: "конец ветвления",
	106: "конец цикла",
	107: "конец процедуры",
	108: "Отказ исполнителя.",
	109: "Превышен допустимый уровень вложенности конструкций.",
	110: "\"иначе\" без предшествующего \"если\"",
	111: "Другая команда.",
	112: "\"конец ветвления\" без предшествующего \"если\"",
	113: "\"конец цикла\" без предшествующего \"пока\"",
	114: "\"конец процедуры\" без предшествующего \"процедура\" или \"сделай\"",
	115: "Определение процедуры не может быть вложено.",
	116: "Процедура \"%1\" не определена.",
	117: "Строка №%1 программы: %2",
	118: "Достигнут конец текста программы.",
	119: "В позиции №%1 обнаружено: ",
	120: "Ожидалось: ",
	121: "Ошибок не обнаружено"
};
/* @license-end */