/* @source: https://github.com/R0bur/drawing-actor/blob/main/script/i18n_be.js */
/* @license magnet:?xt=urn:btih:1f739d935676111cfff4b4693e3816e664797050&dn=gpl-3.0.txt GPL-v3-or-Later */
/*=============================*/
/* Дрэва мовы праграміравання. */
/*=============================*/
i18n.plTree.be = {
	"скачок": -1,
	"крок": -2,
	"паварот": -3,
	"калі": {
		"наперадзе": {
			"край,": {"то": 1},
			"не": {"край,": {"то": 2}}
		},
	},
	"інакш": 3,
	"пакуль": {
		"наперадзе": {
			"край,": {"паўтараць": 4},
			"не": {"край,": {"паўтараць": 5}}
		},
	},
	"канец": {
		"галінавання": 6,
		"цыкла": 7,
		"падпраграмы": 8
	},
	"падпраграма": {"!імя": 9},
	"зрабі": {"!імя": 10}
};
/*===================================================*/
/* Пункты меню з камандамі ў рэжыме праграміравання. */
/*===================================================*/
i18n.edTree.be = {
	"F1": "скачок^скачок.",
	"F2": "крок^крок.",
	"F3": "паварот^паварот.",
	"F4": ["…^ ", {
		"F4": ["калі…^калі ", {
			"F1": "…наперадзе край^наперадзе край, то.",
			"F2": "…наперадзе не край^наперадзе не край, то."
		}],
		"F5": "інакш^інакш.",
		"F6": ["пакуль…^пакуль ", {
			"F1": "…наперадзе край^наперадзе край, паўтараць.",
			"F2": "…наперадзе не край^наперадзе не край, паўтараць."
		}],
		"F7": "зрабі^зрабі ",
		"F8": "падпр^падпраграма ",
		"F9": ["канец…^канец ", {
			"F1": "…галінавання^галінавання.",
			"F2": "…цыкла^цыкла.",
			"F3": "…падпраграмы^падпраграмы."
		}]
	}]
};
/*=================*/
/* Табліца радкоў. */
/*=================*/
i18n.strTable.be = {
	/*------------*/
	/* index.html */
	/*------------*/
	1000: "Выканаўца «Багоўка»",
	1001: "%1. Версія %2.",
	/*----------*/
	/* index.js */
	/*----------*/
	/* Пункт меню ды паведамленні аб выхадзе выканаўцы за межы вобласці малявання. */
	1: "скід",
	2: "АВАРЫЯ - выканаўца зышоў за межы дошкі.",
	3: "Націсніце [ESC] для вяртання ў зыходнае становішча.",
	/* Заголовак і інфармацыйнае паведамленне рэжыма №1 (непасроднае выкананне каманд). */
	4: "Рэжым №1: Непасроднае выкананне каманд.",
	5: "Кіруйце выканаўцам з дапамогай [F1], [F2] і [F3].\nНацісніце [ESC], каб ачысціць дошку для малявання.",
	6: "Націсніце [TAB] для пераходу ў рэжым праграміравання.",
	/* Заголовак і інфармацыйнае паведамленне рэжыма №2 (праграміраванне). */
	7: "Рэжым №2: Праграміраванне выканаўцы.",
	8: "Уводзіце і выпраўляйце праграму.\nНацісніце [ESC], каб выдаліць тэкст праграмы.",
	9: "Націсніце [TAB] для пераходу ў рэжым выканання праграмы.",
	/* Заголовак і інфармацыйнае паведамленне рэжыма №3 (выкананне праграмы). */
	10: "Рэжым №3: Выкананне праграмы.",
	11: "Націсніце [TAB] для пераходу ў рэжым непасроднага выканання каманд.",
	/* Паведамленні аб паспяховым завяршэнні праграмы. */
	12: "+Выкананне праграмы паспяхова завершана.",
	13: "Выканана скачкоў: %1, крокаў: %2, паваротаў: %3.",
	14: "Усяго дзеянняў: %1.",
	/* Паведамленні пра спыненне выканання праграмы карыстальнікам. */
	15: "Праграма спынена.",
	16: "Выкананне праграмы спынена карыстальнікам.",
	/* Паведамленне пра спыненне адладкі праграмы карыстальнікам. */
	17: "-Адладка праграмы спынена карыстальнікам.",
	/* Пункты меню падрэжыму выканання праграмы. */
	18: "стой",
	19: "адладка",
	/* Паведамленне пра працяг выканання праграмы пасля адладкі. */
	20: "Праграма выконваецца…",
	/* Пункты меню падрэжиму адладкі праграмы. */
	21: "скід",
	22: "далей",
	23: "выканаць",
	/* Паведамленне пра пераход у рэжым адладкі праграмы. */
	24: "Ідзе адладка праграмы…",
	/* Пункты меню падрэжыму праграміравання для ўвода дадатковых каманд. */
	54: "назад",
	/* Запыт пацвярджэння на ачыстку зместу рэдактара тэкста праграмы. */
	55: "Выдаліць праграму цэлкам?",
	/* Пункты меню рэжиму №1 (непасроднае выкананне каманд). */
	56: "скачок",
	57: "крок",
	58: "паварот",
	59: "скід",
	60: "праграміраванне",
	/* Пункты меню рэжыму №2 (праграміраванне). */
	64: "ачысціць",
	65: "выкананне",
	/* Пункты меню рэжыму №3 (выкананне праграмы). */
	66: "пуск",
	67: "адладка",
	68: "вынік",
	69: "скід",
	70: "камандаванне",
	/* Радок стану. */
	71: "Гук [Alt+s]:",
	72: "нарм.",
	73: "паш.",
	74: "няма",
	/* Час выканання праграмы. */
	75: "Час выканання: %1 сек.",
	/* Рашэнне задачы. */
	76: "+Заданне ВЫКАНАНА!",
	77: "-Заданне НЕ выканана, таму што:",
	78: "не ўсе зададзеныя адрэзкі зафарбаваны (%1)",
	79: "некаторыя адрэзкі зафарбаваны памылкова (%1)",
	80: "выканаўца не заняў патрабаванага становішча",
	81: "Увядзіце запакаваную ўмову задачы (пусты радок прыбірае пастаўленую задачу).\nУстаўка з буфера абмену: Ctrl+V, Enter.",
	82: "Памылка: не ўдалося распакаваць умову задачы!",
	83: "Вось радок з упакаванай умовай задачы.\nКапіраванне ў буфер абмену: Ctrl+C, Enter.",
	/* Дадатковы інфармацыйны радок для рэжыму выканання праграмы. */
	84: "Націсніце [F1] для запуску праграмы або [F5] для хуткага атрымання выніку.",
	/*------------*/
	/* program.js */
	/*------------*/
	101: "Сінтаксічная памылка.",
	102: "канец радка",
	103: "Памылка выканання праграмы.",
	104: "Адсутнічае каманда \"%1\".",
	105: "канец галінавання",
	106: "канец цыкла",
	107: "канец падпраграмы",
	108: "Збой выканаўцы.",
	109: "Перавышаны магчымы ўзровень укладзенасці канструкцый.",
	110: "\"інакш\" без папярэдняга \"калі\"",
	111: "Іншая каманда.",
	112: "\"канец галінавання\" без папярэдняга \"калі\"",
	113: "\"канец цыкла\" без папярэдняга \"пакуль\"",
	114: "\"канец падпраграмы\" без папярэдняга \"падпраграма\" або \"зрабі\"",
	115: "Вызначэнне падпраграмы не можа быць укладзена.",
	116: "Падпраграма \"%1\" не вызначана.",
	117: "Радок №%1 праграмы: %2",
	118: "Дасягнут канец тэкста праграмы.",
	119: "у пазіцыі №%1 выяўлена: ",
	120: "Чакалася: ",
	121: "Памылак не выяўлена"
};
/* @license-end */